In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
from numpy.random import randn, randint
np.random.seed(10)

In [84]:
labels = ['a', 'b', 'c']
arr = np.array([10, 20, 30])
d = {'a': 10, 'b':20, 'c': 30}

In [85]:
pd.Series(data = arr, index=labels)

a    10
b    20
c    30
dtype: int64

In [86]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [87]:
pd.Series([5,6,7], index = ['q', 'w', 'e'])

q    5
w    6
e    7
dtype: int64

In [88]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [89]:
a = pd.Series([1, 3, 7, 9], ['Computer', 'Monitor', 'Mouse', 'Keyboard'])

In [90]:
b = pd.Series([5, 3, 9, 10], ['Computer', 'Monitor', 'Mouse', 'Hard Disc'])

In [91]:
a+b

Computer      6.0
Hard Disc     NaN
Keyboard      NaN
Monitor       6.0
Mouse        16.0
dtype: float64

In [92]:
a[1:4]

Monitor     3
Mouse       7
Keyboard    9
dtype: int64

In [93]:
a['Computer':'Mouse']

Computer    1
Monitor     3
Mouse       7
dtype: int64

In [94]:
for i in 'abc':
    print (i)

a
b
c

In [95]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns = 'W X Y Z'.split() )

In [96]:
df

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [97]:
df[['W', 'X']]

          W         X
A  1.331587  0.715279
B  0.621336 -0.720086
C  0.004291 -0.174600
D -0.965066  1.028274
E -1.136602  0.135137

In [98]:
df.'W'

SyntaxError: invalid syntax (<ipython-input-98-755649026307>, line 1)

In [99]:
df.W

A    1.331587
B    0.621336
C    0.004291
D   -0.965066
E   -1.136602
Name: W, dtype: float64

In [100]:
df['new'] = [3, 7, 9, 10, 12]

In [101]:
df

          W         X         Y         Z  new
A  1.331587  0.715279 -1.545400 -0.008384    3
B  0.621336 -0.720086  0.265512  0.108549    7
C  0.004291 -0.174600  0.433026  1.203037    9
D -0.965066  1.028274  0.228630  0.445138   10
E -1.136602  0.135137  1.484537 -1.079805   12

In [102]:
df['heey'] = [1, 2, 3]

ValueError: Length of values does not match length of index

In [103]:
df['sum'] = df['X'] + df['Z']

In [104]:
df

          W         X         Y         Z  new       sum
A  1.331587  0.715279 -1.545400 -0.008384    3  0.706895
B  0.621336 -0.720086  0.265512  0.108549    7 -0.611537
C  0.004291 -0.174600  0.433026  1.203037    9  1.028437
D -0.965066  1.028274  0.228630  0.445138   10  1.473412
E -1.136602  0.135137  1.484537 -1.079805   12 -0.944668

In [106]:
df = df.drop('new', axis = 1)

KeyError: "labels ['new'] not contained in axis"

In [81]:
df

In [51]:
df

In [52]:
df

In [108]:
df

          W         X         Y         Z       sum
A  1.331587  0.715279 -1.545400 -0.008384  0.706895
B  0.621336 -0.720086  0.265512  0.108549 -0.611537
C  0.004291 -0.174600  0.433026  1.203037  1.028437
D -0.965066  1.028274  0.228630  0.445138  1.473412
E -1.136602  0.135137  1.484537 -1.079805 -0.944668

In [54]:
a

Computer    1
Monitor     3
Mouse       7
Keyboard    9
dtype: int64

In [110]:
df.drop('W', axis = 1)

          X         Y         Z       sum
A  0.715279 -1.545400 -0.008384  0.706895
B -0.720086  0.265512  0.108549 -0.611537
C -0.174600  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537 -1.079805 -0.944668

In [111]:
df

          W         X         Y         Z       sum
A  1.331587  0.715279 -1.545400 -0.008384  0.706895
B  0.621336 -0.720086  0.265512  0.108549 -0.611537
C  0.004291 -0.174600  0.433026  1.203037  1.028437
D -0.965066  1.028274  0.228630  0.445138  1.473412
E -1.136602  0.135137  1.484537 -1.079805 -0.944668

In [112]:
df.drop('W', axis = 1, inplace = True)

In [113]:
df

          X         Y         Z       sum
A  0.715279 -1.545400 -0.008384  0.706895
B -0.720086  0.265512  0.108549 -0.611537
C -0.174600  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537 -1.079805 -0.944668

In [114]:
df.drop('A')

          X         Y         Z       sum
B -0.720086  0.265512  0.108549 -0.611537
C -0.174600  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537 -1.079805 -0.944668

In [115]:
df

          X         Y         Z       sum
A  0.715279 -1.545400 -0.008384  0.706895
B -0.720086  0.265512  0.108549 -0.611537
C -0.174600  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537 -1.079805 -0.944668

In [116]:
df.loc['A']

X      0.715279
Y     -1.545400
Z     -0.008384
sum    0.706895
Name: A, dtype: float64

In [117]:
df.loc['L'] = randn(4)

In [118]:
df

          X         Y         Z       sum
A  0.715279 -1.545400 -0.008384  0.706895
B -0.720086  0.265512  0.108549 -0.611537
C -0.174600  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537 -1.079805 -0.944668
L -1.977728 -1.743372  0.266070  2.384967

In [119]:
df>0

       X      Y      Z    sum
A   True  False  False   True
B  False   True   True  False
C  False   True   True   True
D   True   True   True   True
E   True   True  False  False
L  False  False   True   True

In [120]:
df[df>0]

          X         Y         Z       sum
A  0.715279       NaN       NaN  0.706895
B       NaN  0.265512  0.108549       NaN
C       NaN  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537       NaN       NaN
L       NaN       NaN  0.266070  2.384967

In [121]:
df.append( pd.DataFrame([1, 2, 3,4], index = 'JJ'))

TypeError: Index(...) must be called with a collection of some kind, 'JJ' was passed

In [126]:
df[(df['Y'] > 0) | (df['X'] > 0)]

          X         Y         Z       sum
A  0.715279 -1.545400 -0.008384  0.706895
B -0.720086  0.265512  0.108549 -0.611537
C -0.174600  0.433026  1.203037  1.028437
D  1.028274  0.228630  0.445138  1.473412
E  0.135137  1.484537 -1.079805 -0.944668

In [127]:
df.reset_index()

  index         X         Y         Z       sum
0     A  0.715279 -1.545400 -0.008384  0.706895
1     B -0.720086  0.265512  0.108549 -0.611537
2     C -0.174600  0.433026  1.203037  1.028437
3     D  1.028274  0.228630  0.445138  1.473412
4     E  0.135137  1.484537 -1.079805 -0.944668
5     L -1.977728 -1.743372  0.266070  2.384967

In [128]:
df.reset_index(inplace=True)

In [129]:
df

  index         X         Y         Z       sum
0     A  0.715279 -1.545400 -0.008384  0.706895
1     B -0.720086  0.265512  0.108549 -0.611537
2     C -0.174600  0.433026  1.203037  1.028437
3     D  1.028274  0.228630  0.445138  1.473412
4     E  0.135137  1.484537 -1.079805 -0.944668
5     L -1.977728 -1.743372  0.266070  2.384967

In [130]:
df['index']

0    A
1    B
2    C
3    D
4    E
5    L
Name: index, dtype: object

In [131]:
df.index = list(df['index'])

In [132]:
df

  index         X         Y         Z       sum
A     A  0.715279 -1.545400 -0.008384  0.706895
B     B -0.720086  0.265512  0.108549 -0.611537
C     C -0.174600  0.433026  1.203037  1.028437
D     D  1.028274  0.228630  0.445138  1.473412
E     E  0.135137  1.484537 -1.079805 -0.944668
L     L -1.977728 -1.743372  0.266070  2.384967

In [135]:
df.drop('index',axis = 1, inplace = True)

In [8]:
mdf = pd.DataFrame(randn(6,3), columns = 'A B C'. split())

In [9]:
mdf

          A         B         C
0  1.484537 -1.079805 -1.977728
1 -1.743372  0.266070  2.384967
2  1.123691  1.672622  0.099149
3  1.397996 -0.271248  0.613204
4 -0.267317 -0.549309  0.132708
5 -0.476142  1.308473  0.195013

In [10]:
mdf.index = pd.MultiIndex(levels = [['Almaty', 'Astana'], ['Kids', 'Male', 'Female']], labels = [[0, 0 , 0, 1, 1, 1], [0,1, 2, 0 ,1 ,1]])

In [11]:
mdf

                      A         B         C
Almaty Kids    1.484537 -1.079805 -1.977728
       Male   -1.743372  0.266070  2.384967
       Female  1.123691  1.672622  0.099149
Astana Kids    1.397996 -0.271248  0.613204
       Male   -0.267317 -0.549309  0.132708
       Male   -0.476142  1.308473  0.195013

In [12]:
mdf.index.names = ['City', 'Gender']

In [13]:
mdf

                      A         B         C
City   Gender
Almaty Kids    1.484537 -1.079805 -1.977728
       Male   -1.743372  0.266070  2.384967
       Female  1.123691  1.672622  0.099149
Astana Kids    1.397996 -0.271248  0.613204
       Male   -0.267317 -0.549309  0.132708
       Male   -0.476142  1.308473  0.195013

In [15]:
mdf.loc['Almaty'].loc['Male']

A   -1.743372
B    0.266070
C    2.384967
Name: Male, dtype: float64

In [18]:
mdf.xs(["Almaty", "Male"])

                      A        B         C
City   Gender
Almaty Male   -1.743372  0.26607  2.384967

In [23]:
df1 = pd.DataFrame({'A':[1, 2,np.nan], 
                  'B':[5, np.nan ,np.nan], 
                  'C':[1,2, 7]} )

In [24]:
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [25]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [26]:
df1.fillna(value = 0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  7

In [29]:
df1['A'].fillna(value = df1['A'].mean(), inplace = True)

In [30]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  7

In [33]:
for col in df1.columns:
    df1[col].fillna(value = df1[col].mean(), inplace= True)
    #print(col),

In [34]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  7

In [35]:
data = {'Company': ["GOOG", "GOOG", "MSFT", "MSFT", 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl'], 
        'Sales': [200, 120, 340, 500, 660]}

In [36]:
df3 = pd.DataFrame(data)

In [37]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    500
4      FB     Carl    660

In [38]:
df3.head(3)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340

In [39]:
df3.groupby('Company')

In [40]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    500
4      FB     Carl    660

In [41]:
df3.groupby('Company').mean()

         Sales
Company
FB         660
GOOG       160
MSFT       420

In [43]:
df3.groupby('Company').min()

          Person  Sales
Company
FB          Carl    660
GOOG     Charlie    120
MSFT         Amy    340

In [46]:
df3[['Person','Company']].groupby('Company').min()

          Person
Company
FB          Carl
GOOG     Charlie
MSFT         Amy

In [45]:
df3

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    500
4      FB     Carl    660

In [50]:
df3.groupby('Company').describe().T

Company         FB        GOOG        MSFT
Sales count    1.0    2.000000    2.000000
      mean   660.0  160.000000  420.000000
      std      NaN   56.568542  113.137085
      min    660.0  120.000000  340.000000
      25%    660.0  140.000000  380.000000
      50%    660.0  160.000000  420.000000
      75%    660.0  180.000000  460.000000
      max    660.0  200.000000  500.000000